sngenbb_manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SNGenbb Manager Configuration</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css">
                 <link rel="stylesheet" href="css/org-pygments.css">
                 <link rel="stylesheet" href="//netdna.bootstrapcdn.com/font-awesome/4.0.3/css/font-awesome.css">
</head>
<body onload="displayTOC()"><div id="toc"></div>
<div id="content">
<h1 class="title">SNGenbb Manager Configuration</h1>
<div id="table-of-contents">
<h2></h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Manager configuration</a>
<ul>
<li><a href="#sec-2-1">2.1. Genbb manager configuration</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Genbb wrappers</a>
<ul>
<li><a href="#sec-3-1">3.1. Radioelement wrappers</a></li>
<li><a href="#sec-3-2">3.2. Single particle generator</a></li>
<li><a href="#sec-3-3">3.3. <span class="todo TODO">TODO</span> Combined generators</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>genbb</code> package is dedicated to the generation of double beta decay and/or
radioactive background primary events as input for a simulation program.
</p>

<p>
More details concerning the use of <code>genbb</code> can be found in <a href="https://nemo.lpc-caen.in2p3.fr/wiki/genbb_help">LPC wiki</a>.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Manager configuration</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Genbb manager configuration</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Here, general options such as verbosity, debug flags are passed to <code>genbb</code>
manager.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@config Main configuration parameters for the genbb manager</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of files containing particle generator definition rules</span>
generators.configuration_files : string[5] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@falaise:config/common/simulation/primary_events/1.0/background.def"</span>  <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@falaise:config/common/simulation/primary_events/1.0/calibration.def"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@falaise:config/common/simulation/primary_events/1.0/dbd.def"</span>         <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"@falaise:config/common/simulation/primary_events/1.0/misc.def"</span>        <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/sngenbb_wrappers.conf"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Genbb wrappers</h2>
<div class="outline-text-2" id="text-3">
<p>
This section holds the configuration of several <code>genbb</code> wrappers.
</p>

<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of setups</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>
</pre>
</div>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Radioelement wrappers</h3>
<div class="outline-text-3" id="text-3-1">
<p>
This part basically provides additionnal event generator wrappers for
SuperNEMO.
</p>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> &nbsp;<sup>214</sup>Pb &beta;&beta;0&nu;</h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Following a <a href="http://nile.hep.utexas.edu/cgi-bin/DocDB/ut-nemo/private/ShowDocument?docid=2946">talk</a> given by Vladimir Treytak during Bratislava collaboration
meeting, 2013,&nbsp;<sup>214</sup>Pb is also a 2&beta; emitter
</p>
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"bb0nu_Pb214"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genbb::wdecay0"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@config Neutrinoless double beta decay of Pb-214 [DBD]</span>
decay_type      : <span class="org-variable-name">string</span>  = <span class="org-string">"DBD"</span>
decay_isotope   : <span class="org-variable-name">string</span>  = <span class="org-string">"Pb214"</span>
decay_dbd_level : <span class="org-variable-name">integer</span> = 0
decay_dbd_mode  : <span class="org-variable-name">integer</span> = 1
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Single particle generator</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Here, single particle can be generated using different energy distribution : fix
energy, flat energy distribution given energy limits, gaussian energy
distribution or following a tabulated energy spectrum.
</p>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Single electron with flat energy distribution</h4>
<div class="outline-text-4" id="text-3-2-1">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"electron_0-3MeV_flat"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genbb::single_particle_generator"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Parameters for the "single_particle" mode (class genbb::single_particle_generator):</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Seed for the embedded random number generator:</span>
seed                  : <span class="org-variable-name">integer</span> = 314159

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generated particle ("electron", "positron", "gamma", "alpha"):</span>
particle_name         : <span class="org-variable-name">string</span> = <span class="org-string">"electron"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Mode ("energy_range", "gaussian_energy", "monokinetic", "spectrum"):</span>
mode                  : <span class="org-variable-name">string</span> = <span class="org-string">"energy_range"</span>

<span class="org-comment-delimiter">### </span><span class="org-comment">Only for "energy_range" mode:</span>
min_energy            : <span class="org-variable-name">real</span>   = 0000.
max_energy            : <span class="org-variable-name">real</span>   = 3000.
energy_unit           : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">### </span><span class="org-comment">Only for "gaussian_energy" mode:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">mean_energy           : real   = 1000.</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">sigma_energy          : real   =  100.</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">energy_unit           : string = "keV"</span>

<span class="org-comment-delimiter">### </span><span class="org-comment">Only for "monokinetic" mode:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">energy                : real   = 5500.</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">energy_unit           : string = "keV"</span>

<span class="org-comment-delimiter">### </span><span class="org-comment">Only for "spectrum" mode:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">spectrum.data_file    : string = "${SNGENBB_DATA_DIR}/testing/data/sample_tabulated_energy_spectrum.data"</span>

randomized_direction   : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Single gamma with flat energy distribution</h4>
<div class="outline-text-4" id="text-3-2-2">
<div class="org-src-container">

<pre class="src src-sh">[<span class="org-variable-name">name</span>=<span class="org-string">"gamma_0-3MeV_flat"</span> <span class="org-variable-name">type</span>=<span class="org-string">"genbb::single_particle_generator"</span>]

<span class="org-comment-delimiter">#</span><span class="org-comment">@config Parameters for the "single_particle" mode (class genbb::single_particle_generator):</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Seed for the embedded random number generator:</span>
seed                  : <span class="org-variable-name">integer</span> = 314159

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Generated particle ("electron", "positron", "gamma", "alpha"):</span>
particle_name         : <span class="org-variable-name">string</span> = <span class="org-string">"gamma"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Mode ("energy_range", "gaussian_energy", "monokinetic", "spectrum"):</span>
mode                  : <span class="org-variable-name">string</span> = <span class="org-string">"energy_range"</span>

<span class="org-comment-delimiter">### </span><span class="org-comment">Only for "energy_range" mode:</span>
min_energy            : <span class="org-variable-name">real</span>   = 1000.
max_energy            : <span class="org-variable-name">real</span>   = 1000.
energy_unit           : <span class="org-variable-name">string</span> = <span class="org-string">"keV"</span>

<span class="org-comment-delimiter">### </span><span class="org-comment">Only for "gaussian_energy" mode:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">mean_energy           : real   = 1000.</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">sigma_energy          : real   =  100.</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">energy_unit           : string = "keV"</span>

<span class="org-comment-delimiter">### </span><span class="org-comment">Only for "monokinetic" mode:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">energy                : real   = 5500.</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">energy_unit           : string = "keV"</span>

<span class="org-comment-delimiter">### </span><span class="org-comment">Only for "spectrum" mode:</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">spectrum.data_file    : string = "${SNGENBB_DATA_DIR}/testing/data/sample_tabulated_energy_spectrum.data"</span>

randomized_direction   : <span class="org-variable-name">boolean</span> = 1
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> Combined generators</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Combination of several <code>genbb</code> generators can be done using
<code>genbb::combined_particle_generator</code> object&#x2026;
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under git version control - commit <a href="https://github.com/xgarrido/master_npp_teaching/commit/de670a2534c568f9a55c9e4c13c66212a371a2f0">de670a2</a> - 2014-03-18
</div>
</body>
</html>
